import time

d = 2  # 计算位数
m1 = 1  # 小方块质量
m2 = 10 ** d  # 大方块质量
v1 = 0  # 小方块初速度
v2 = -1  # 大方块初速度，负号表示向左
num = 0  # 碰撞计数

t1 = time.time()
while True:
    # 第一种情况：方块相互碰撞，根据公式计算碰撞后方块速度
    v1_ = (v1*(m1-m2)+2*m2*v2)/(m1+m2)
    v2_ = (v2*(m2-m1)+2*m1*v1)/(m1+m2)
    num += 1
    # 第二种情况：小方块速度向左时，必定撞墙
    if v1_ < 0:
        v1_ = -v1_  # 撞墙后方向取反
        num += 1
    # 当大小方块都向右滑动且小方块慢时，不会再发生碰撞
    if v1_ >= 0 and v2_ >= 0 and v1_ < v2_:
        break
    # 获得下一次碰撞的速度
    v1 = v1_
    v2 = v2_
t2 = time.time()

print('碰撞次数：', num)
print('计算用时%f秒' % (t2-t1))